### Terraform Plan - `k8s-cluster` 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform azurerm_resource_group.default: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/birki-k8s-rg-dev]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/birki-k8s-rg-dev/providers/Microsoft.ContainerRegistry/registries/birkik8sacrdev]
azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourcegroups/birki-k8s-rg-dev/providers/Microsoft.ContainerService/managedClusters/birki-k8s-aks-dev]
azurerm_role_assignment.acrpull_role: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/birki-k8s-rg-dev/providers/Microsoft.ContainerRegistry/registries/birkik8sacrdev/providers/Microsoft.Authorization/roleAssignments/bdd8d351-a3ce-2664-39bc-3f4ea568b7c8]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s-cluster`, Workflow: `deployment`

### Terraform Plan - `k8s` 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform module.frontend.kubectl_manifest.frontend_namespace[0]: Refreshing state... [id=/api/v1/namespaces/frontend]
module.backend.kubectl_manifest.backend_namespace[0]: Refreshing state... [id=/api/v1/namespaces/backend]
module.backend.kubectl_manifest.backend_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/backend/deployments/backend]
module.backend.kubectl_manifest.backend_service[0]: Refreshing state... [id=/api/v1/namespaces/backend/services/backend]
module.frontend.kubectl_manifest.frontend_secret[0]: Refreshing state... [id=/api/v1/namespaces/frontend/secrets/frontend-secret]
module.frontend.kubectl_manifest.frontend_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/frontend/deployments/frontend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.kubectl_manifest.frontend_deployment[0] has been changed
  ~ resource "kubectl_manifest" "frontend_deployment" {
        id                      = "/apis/apps/v1/namespaces/frontend/deployments/frontend"
      ~ live_resource_version   = "8834" -> "9734"
        name                    = "frontend"
        # (14 unchanged attributes hidden)
    }
  # module.backend.kubectl_manifest.backend_deployment[0] has been deleted
  - resource "kubectl_manifest" "backend_deployment" {
      - api_version             = "apps/v1" -> null
      - force_new               = false -> null
      - id                      = "/apis/apps/v1/namespaces/backend/deployments/backend" -> null
      - kind                    = "Deployment" -> null
      - live_manifest_incluster = (sensitive value)
      - live_resource_version   = "8854" -> null
      - live_uid                = "54002e39-7f62-4640-b22e-17220273d160" -> null
      - name                    = "backend" -> null
      - namespace               = "backend" -> null
      - resource_version        = "8749" -> null
      - server_side_apply       = false -> null
      - uid                     = "54002e39-7f62-4640-b22e-17220273d160" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: backend
              name: backend
              namespace: backend
            spec:
              replicas: 2
              selector:
                matchLabels:
                  name: backend
              template:
                metadata:
                  labels:
                    name: backend
                spec:
                  containers:
                  - args:
                    - app.py
                    command:
                    - python3
                    image: birkik8sacrdev.azurecr.io/backend:9689daf0
                    imagePullPolicy: Always
                    name: backend
                    ports:
                    - containerPort: 5000
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.backend.kubectl_manifest.backend_deployment[0] will be created
  + resource "kubectl_manifest" "backend_deployment" {
      + api_version             = "apps/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "backend"
      + namespace               = "backend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: backend
              name: backend
              namespace: backend
            spec:
              replicas: 2
              selector:
                matchLabels:
                  name: backend
              template:
                metadata:
                  labels:
                    name: backend
                spec:
                  containers:
                  - args:
                    - app.py
                    command:
                    - python3
                    image: birkik8sacrdev.azurecr.io/backend:1a47fc29
                    imagePullPolicy: Always
                    name: backend
                    ports:
                    - containerPort: 5000
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.frontend.kubectl_manifest.frontend_deployment[0] will be updated in-place
  ~ resource "kubectl_manifest" "frontend_deployment" {
        id                      = "/apis/apps/v1/namespaces/frontend/deployments/frontend"
        name                    = "frontend"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: frontend
              name: frontend
              namespace: frontend
            spec:
              replicas: 1
              selector:
                matchLabels:
                  name: frontend
              template:
                metadata:
                  labels:
                    name: frontend
                spec:
                  containers:
                  - args:
                    - app.js
                    command:
                    - node
                    env:
                    - name: DISCORD_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: DISCORD_TOKEN
                          name: frontend-secret
                    - name: ENVIRONMENT
                      value: prod
          -         image: birkik8sacrdev.azurecr.io/frontend:9689daf0
          +         image: birkik8sacrdev.azurecr.io/frontend:1a47fc29
                    imagePullPolicy: Always
                    name: frontend
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ backend_image_tag  = "9689daf0" -> "1a47fc29"
  ~ frontend_image_tag = "9689daf0" -> "1a47fc29"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s`, Workflow: `deployment`